## 3. 그룹 함수

In [2]:
import pandas as pd
import numpy as np

## 1) Merge

### 1-1. Merge on 'column'

In [12]:
data1 = {'data_1' : range(5),
         'key' : ['a', 'c', 'd', 'b', 'c']}
df1 = pd.DataFrame(data1)
df1

   data_1 key
0       0   a
1       1   c
2       2   d
3       3   b
4       4   c

In [13]:
data2 = {'data_2' : range(3),
         'key' : ['a', 'd', 'b']}
df2 = pd.DataFrame(data2)
df2

   data_2 key
0       0   a
1       1   d
2       2   b

###### <span style="color:blue">Example 1. 동일한 키가 있는 경우</span>

In [14]:
# column 'key'로 df1, df2 merge

   data_1 key  data_2
0       0   a       0
1       2   d       1
2       3   b       2

### 1-2. Merge left on 'column_1' right on 'column_2'
두 객체에 공통되는 칼럼 이름이 없는 경우 left_on, right_on 으로 column 지정

In [34]:
data1 = {'data_1' : range(5),
         'key_1' : ['a', 'c', 'a', 'b', 'c']}
df1 = pd.DataFrame(data1)
df1

   data_1 key_1
0       0     a
1       1     c
2       2     a
3       3     b
4       4     c

In [35]:
data2 = {'data_2' : range(3),
         'key_2' : ['a', 'd', 'b']}
df2 = pd.DataFrame(data2)
df2

   data_2 key_2
0       0     a
1       1     d
2       2     b

###### <span style="color:blue">Example 2. 동일 column이 없는 경우</span>

In [24]:
pd.merge(df1, df2, left_on='key_1', right_on='key_2')

   data_1 key_1  data_2 key_2
0       0     a       0     a
1       2     a       0     a
2       3     b       2     b

### 1-3. Merge (how = __VALUE__) 
- how : left, right, outer, inner

In [43]:
data1 = {'data_1' : range(5),
         'key' : ['a', 'c', 'd', 'b', 'c']}
df1 = pd.DataFrame(data1)
df1

   data_1 key
0       0   a
1       1   c
2       2   d
3       3   b
4       4   c

In [44]:
data2 = {'data_2' : range(3),
         'key' : ['a', 'e', 'b']}
df2 = pd.DataFrame(data2)
df2

   data_2 key
0       0   a
1       1   e
2       2   b

######  <span style="color:blue">Example 3. merge</span>

#### 1) Merge (how = 'left')

In [30]:
pd.merge(df1, df2, how='left')

   data_1 key  data_2
0       0   a     0.0
1       1   c     NaN
2       2   d     NaN
3       3   b     2.0
4       4   c     NaN

#### 2) Merge (how = 'right')

In [32]:
pd.merge(df1, df2, how='right')

   data_1 key  data_2
0     0.0   a       0
1     3.0   b       2
2     NaN   e       1

#### 3) Merge (how = 'outer')

In [45]:
# df1, df2의 동일 column을 기준으로 merge (outer)

   data_1 key  data_2
0     0.0   a     0.0
1     1.0   c     NaN
2     4.0   c     NaN
3     2.0   d     NaN
4     3.0   b     2.0
5     NaN   e     1.0

#### 4) Merge (how = 'inner')

In [46]:
# df1, df2의 동일 column을 기준으로 merge (inner)

   data_1 key  data_2
0       0   a       0
1       3   b       2

#### 참고. merge(how=_VALUE_) 사용 시, 공통 키가 없는 경우

In [38]:
data1 = {'data_1' : range(5),
         'key_1' : ['a', 'c', 'a', 'b', 'c']}
df1 = pd.DataFrame(data1)
df1

   data_1 key_1
0       0     a
1       1     c
2       2     a
3       3     b
4       4     c

In [39]:
data2 = {'data_2' : range(3),
         'key_2' : ['a', 'd', 'b']}
df2 = pd.DataFrame(data2)
df2

   data_2 key_2
0       0     a
1       1     d
2       2     b

In [41]:
# Error 발생 !!! 
pd.merge(df1, df2, how='right')

MergeError: No common columns to perform merge on

## 2) concat

### 2-1. Series 연결하기

In [48]:
pd.concat?

#### 1. concat (axis=0) : Row로 연결하기

In [47]:
s1 = pd.Series(['a', 'b'],      index=[0, 1])
s2 = pd.Series(['c', 'd', 'e'], index=[2, 3, 4])
s3 = pd.Series(['f', 'g'],      index=[5, 6])

pd.concat([s1, s2, s3])

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

#### 2. concat (axis=1) : Column으로 연결하기 (Series -> DataFrame)

In [49]:
s1 = pd.Series(['a', 'b'],      index=[0, 1])
s2 = pd.Series(['c', 'd', 'e'], index=[2, 3, 4])
s3 = pd.Series(['f', 'g'],      index=[5, 6])

pd.concat([s1, s2, s3], axis=1)

     0    1    2
0    a  NaN  NaN
1    b  NaN  NaN
2  NaN    c  NaN
3  NaN    d  NaN
4  NaN    e  NaN
5  NaN  NaN    f
6  NaN  NaN    g

### 2-2. DataFrame 연결하기

In [17]:
data1 = np.arange(6).reshape(3, 2)
df1 = pd.DataFrame(data1, index=['a', 'b', 'c'], columns=['c1', 'c2'])
df1

   c1  c2
a   0   1
b   2   3
c   4   5

In [20]:
data2 = np.arange(8).reshape(4, 2)
df2 = pd.DataFrame(data2, index=['a', 'd', 'c', 'e'], columns=['c3', 'c4'])
df2

   c3  c4
a   0   1
d   2   3
c   4   5
e   6   7

#### 1. concat (axis=0)

In [21]:
pd.concat([df1, df2], axis=0)

    c1   c2   c3   c4
a  0.0  1.0  NaN  NaN
b  2.0  3.0  NaN  NaN
c  4.0  5.0  NaN  NaN
a  NaN  NaN  0.0  1.0
d  NaN  NaN  2.0  3.0
c  NaN  NaN  4.0  5.0
e  NaN  NaN  6.0  7.0

######  <span style="color:blue">Example 4. Reset Index</span>

In [27]:
# Index reset : ignore_index=True
# reset_index

pd.concat([df1, df2], axis=0, ignore_index=True)

    c1   c2   c3   c4
0  0.0  1.0  NaN  NaN
1  2.0  3.0  NaN  NaN
2  4.0  5.0  NaN  NaN
3  NaN  NaN  0.0  1.0
4  NaN  NaN  2.0  3.0
5  NaN  NaN  4.0  5.0
6  NaN  NaN  6.0  7.0

#### 2. concat (axis=1)

In [61]:
pd.concat([df1, df2], axis=1)

    c1   c2   c3   c4
a  0.0  1.0  0.0  1.0
b  2.0  3.0  NaN  NaN
c  4.0  5.0  4.0  5.0
d  NaN  NaN  2.0  3.0
e  NaN  NaN  6.0  7.0

## 3) GroupBy

In [38]:
data = {'key'   : ['A', 'B', 'B', 'A', 'B'],
        'value' : [1, 1, 2, 2, 3]}
df = pd.DataFrame(data)
df

  key  value
0   A      1
1   B      1
2   B      2
3   A      2
4   B      3

######  <span style="color:blue">Example 5</span>

In [69]:
# groupby('key')['value']
# - A [1, 2]    --> sum 
# - B [1, 2, 3] --> sum

key
A    3
B    6
Name: value, dtype: int64

In [74]:
# 평균
df.groupby('key')['value'].mean()

key
A    1.5
B    2.0
Name: value, dtype: float64

In [73]:
# Data Size (그룹의 원소 개수)
df.groupby('key')['value'].size()

key
A    2
B    3
Name: value, dtype: int64

#### 한개 이상의 column으로 Group 화

In [75]:
data = {'key1'   : ['A', 'B', 'B', 'A', 'B'],
        'key2'   : ['C', 'C', 'C', 'D', 'D'],
        'value'  : [1, 1, 2, 2, 3]}
df = pd.DataFrame(data)
df

  key1 key2  value
0    A    C      1
1    B    C      1
2    B    C      2
3    A    D      2
4    B    D      3

In [77]:
df.groupby(['key1', 'key2'])['value'].sum()

key1  key2
A     C       1
      D       2
B     C       3
      D       3
Name: value, dtype: int64